wisteria-1c/Конфигурация/Enums/СтатусыЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подключить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пригласить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвердить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уточнить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исправить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПолучен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/CommonForms/ПодключаемыеСтатусыЭДО/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Свойство("Контекст", Контекст) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ИспользоватьОтложеннуюОтправкуЭД = НастройкиЭДО.ОтложеннаяОтправкаЭлектронныхДокументов();
	ВывестиСтатус();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Форма = ВладелецФормы;
	Если Форма.Модифицированность Или Не ЗначениеЗаполнено(Контекст.Ссылка) Тогда
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
				|Выполнение действия по ЭДО возможно только после записи данных.
				|Данные будут записаны.'");
			
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеЗаписиВладельца",
			ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияСостоянияЭДО() Тогда
		ВывестиСтатус();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьДанныеВФайл(Команда)
	Закрыть(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭД(Команда)
	Закрыть(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктуальныйЭД(Команда)
	Закрыть(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущиеДелаЭДО(Команда)
	Закрыть(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьДокумент(Команда)
	Закрыть(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОрганизацию(Команда)
	Закрыть(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПригласитьКОбменуЭДО(Команда)
	Закрыть(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПроизвольныйДокумент(Команда)
	Закрыть(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПодписатьОтправитьЭД(Команда)

	Закрыть(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПодписатьЭД(Команда)
	Закрыть(Команда.Имя);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиСтатус()
	ТекущийСтатус = ПодключаемыеСтатусыЭДО.ПолучитьСтатус(Контекст);
	ПараметрыСтатуса = ОбщегоНазначения.ПараметрыСтатуса();
	ПараметрыСтатуса.Наименование = Строка(ТекущийСтатус);
	ПараметрыСтатуса.Картинка = ПодключаемыеСтатусыЭДО.КартинкаПоСтатусу(ТекущийСтатус);
	ПараметрыСтатуса.Идентификатор = "СтатусЭДО";
	ОбщегоНазначения.ДобавитьСтатус(ЭтотОбъект, ПараметрыСтатуса);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	ОбновитьКомандыПоСтатусу(ТекущийСтатус);
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомандыПоСтатусу(ТекущийСтатус)
	ЭтоИсходящий = Контекст.Направление = Перечисления.НаправленияЭДО.Исходящий;
	ЭтоВходящий = Контекст.Направление = Перечисления.НаправленияЭДО.Входящий;
	Элементы.ВыгрузитьДанныеВФайл.Видимость = ЭтоИсходящий;
	Если ТекущийСтатус = Перечисления.СтатусыЭДО.Подключить Тогда
		Элементы.ПодключитьОрганизацию.Видимость = Истина;
		Элементы.ПригласитьКОбменуЭДО.Видимость = Ложь;
		Элементы.ОткрытьАктуальныйЭД.Видимость = Ложь;
		Элементы.СформироватьПодписатьОтправитьЭД.Видимость = Ложь;
		Элементы.СформироватьПодписатьЭД.Видимость = Ложь;
		Элементы.ДеревоЭД.Видимость = Ложь;
		Элементы.ПерезаполнитьДокумент.Видимость = Ложь;
		Элементы.СоздатьПроизвольныйДокумент.Видимость = Ложь;
		Элементы.ОткрытьТекущиеДелаЭДО.Видимость = Ложь;
		
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЭДО.Пригласить Тогда
		
		Элементы.ПодключитьОрганизацию.Видимость = Ложь;
		Элементы.ПригласитьКОбменуЭДО.Видимость = Истина;
		Элементы.ОткрытьАктуальныйЭД.Видимость = Ложь;
		Элементы.СформироватьПодписатьОтправитьЭД.Видимость = Ложь;
		Элементы.СформироватьПодписатьЭД.Видимость = Ложь;
		Элементы.ДеревоЭД.Видимость = Ложь;
		Элементы.ПерезаполнитьДокумент.Видимость = Ложь;
		Элементы.СоздатьПроизвольныйДокумент.Видимость = Ложь;
		Элементы.ОткрытьТекущиеДелаЭДО.Видимость = Истина;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЭДО.Завершен Тогда
		Элементы.ПодключитьОрганизацию.Видимость = Ложь;
		Элементы.ПригласитьКОбменуЭДО.Видимость = Ложь;
		Элементы.ОткрытьАктуальныйЭД.Видимость = Истина;
		Элементы.СформироватьПодписатьОтправитьЭД.Видимость = Ложь;
		Элементы.СформироватьПодписатьЭД.Видимость = Ложь;
		Элементы.ДеревоЭД.Видимость = Истина;
		Элементы.ПерезаполнитьДокумент.Видимость = ЭтоВходящий;
		Элементы.СоздатьПроизвольныйДокумент.Видимость = Истина;
		Элементы.ОткрытьТекущиеДелаЭДО.Видимость = Истина;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЭДО.Создать Тогда
		Элементы.ПодключитьОрганизацию.Видимость = Ложь;
		Элементы.ПригласитьКОбменуЭДО.Видимость = Ложь;
		Элементы.ОткрытьАктуальныйЭД.Видимость = Истина;
		Элементы.СформироватьПодписатьОтправитьЭД.Видимость = Не ИспользоватьОтложеннуюОтправкуЭД;
		Элементы.СформироватьПодписатьЭД.Видимость = ИспользоватьОтложеннуюОтправкуЭД;
		Элементы.ДеревоЭД.Видимость = Ложь;
		Элементы.ПерезаполнитьДокумент.Видимость = Ложь;
		Элементы.СоздатьПроизвольныйДокумент.Видимость = Истина;
		Элементы.ОткрытьТекущиеДелаЭДО.Видимость = Истина;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЭДО.НеПолучен Тогда
		Элементы.ПодключитьОрганизацию.Видимость = Ложь;
		Элементы.ПригласитьКОбменуЭДО.Видимость = Ложь;
		Элементы.ОткрытьАктуальныйЭД.Видимость = Ложь;
		Элементы.СформироватьПодписатьОтправитьЭД.Видимость = Ложь;
		Элементы.СформироватьПодписатьЭД.Видимость = Ложь;
		Элементы.ДеревоЭД.Видимость = Ложь;
		Элементы.ПерезаполнитьДокумент.Видимость = Ложь;
		Элементы.СоздатьПроизвольныйДокумент.Видимость = Истина;
		Элементы.ОткрытьТекущиеДелаЭДО.Видимость = Истина;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЭДО.Подписание Тогда
		Элементы.ПодключитьОрганизацию.Видимость = Ложь;
		Элементы.ПригласитьКОбменуЭДО.Видимость = Ложь;
		Элементы.ОткрытьАктуальныйЭД.Видимость = Истина;
		Элементы.СформироватьПодписатьОтправитьЭД.Видимость = Не ИспользоватьОтложеннуюОтправкуЭД;
		Элементы.СформироватьПодписатьЭД.Видимость = ИспользоватьОтложеннуюОтправкуЭД;
		Элементы.ДеревоЭД.Видимость = Истина;
		Элементы.ПерезаполнитьДокумент.Видимость = Истина;
		Элементы.СоздатьПроизвольныйДокумент.Видимость = Истина;
		Элементы.ОткрытьТекущиеДелаЭДО.Видимость = Истина;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЭДО.Отклонен Тогда
		Элементы.ПодключитьОрганизацию.Видимость = Ложь;
		Элементы.ПригласитьКОбменуЭДО.Видимость = Ложь;
		Элементы.ОткрытьАктуальныйЭД.Видимость = Истина;
		Элементы.СформироватьПодписатьОтправитьЭД.Видимость = Не ИспользоватьОтложеннуюОтправкуЭД;
		Элементы.СформироватьПодписатьЭД.Видимость = ИспользоватьОтложеннуюОтправкуЭД;
		Элементы.ДеревоЭД.Видимость = Истина;
		Элементы.ПерезаполнитьДокумент.Видимость = Ложь;
		Элементы.СоздатьПроизвольныйДокумент.Видимость = Истина;
		Элементы.ОткрытьТекущиеДелаЭДО.Видимость = Истина;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЭДО.Отправлен
		Или ТекущийСтатус = Перечисления.СтатусыЭДО.Утвердить
		Или ТекущийСтатус = Перечисления.СтатусыЭДО.Уточнить
		Или ТекущийСтатус = Перечисления.СтатусыЭДО.Исправить Тогда
		Элементы.ПодключитьОрганизацию.Видимость = Ложь;
		Элементы.ПригласитьКОбменуЭДО.Видимость = Ложь;
		Элементы.ОткрытьАктуальныйЭД.Видимость = Истина;
		Элементы.СформироватьПодписатьОтправитьЭД.Видимость = Ложь;
		Элементы.СформироватьПодписатьЭД.Видимость = Ложь;
		Элементы.ДеревоЭД.Видимость = Истина;
		Элементы.ПерезаполнитьДокумент.Видимость = ЭтоВходящий;
		Элементы.СоздатьПроизвольныйДокумент.Видимость = Истина;
		Элементы.ОткрытьТекущиеДелаЭДО.Видимость = Истина;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЭДО.Отправить Тогда
		Элементы.ПодключитьОрганизацию.Видимость = Ложь;
		Элементы.ПригласитьКОбменуЭДО.Видимость = Ложь;
		Элементы.ОткрытьАктуальныйЭД.Видимость = Истина;
		Элементы.СформироватьПодписатьОтправитьЭД.Видимость = Истина;
		Элементы.СформироватьПодписатьЭД.Видимость = Ложь;
		Элементы.ДеревоЭД.Видимость = Истина;
		Элементы.ПерезаполнитьДокумент.Видимость = Ложь;
		Элементы.СоздатьПроизвольныйДокумент.Видимость = Истина;
		Элементы.ОткрытьТекущиеДелаЭДО.Видимость = Истина;
	Иначе
		Элементы.ПодключитьОрганизацию.Видимость = Ложь;
		Элементы.ПригласитьКОбменуЭДО.Видимость = Ложь;
		Элементы.ОткрытьАктуальныйЭД.Видимость = Истина;
		Элементы.СформироватьПодписатьОтправитьЭД.Видимость = Не ИспользоватьОтложеннуюОтправкуЭД;
		Элементы.СформироватьПодписатьЭД.Видимость = ИспользоватьОтложеннуюОтправкуЭД;
		Элементы.ДеревоЭД.Видимость = Истина;
		Элементы.ПерезаполнитьДокумент.Видимость = Ложь;
		Элементы.СоздатьПроизвольныйДокумент.Видимость = Истина;
		Элементы.ОткрытьТекущиеДелаЭДО.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПодтверждениеЗаписиВладельца(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		Форма = ВладелецФормы;
		Форма.Записать();
	КонецЕсли;
	Закрыть();
КонецПроцедуры

#КонецОбласти
